# YOLOv10 Brain Tumor Detection Model with Enhanced Spatial Attention
# Modified from YOLOv10n for medical imaging

# Parameters
nc: 1  # number of classes (tumor vs no tumor)
scales:
  n: [0.33, 0.25, 1024]  # keeping the same scaling for efficiency

# Attention Module Parameters
attention:
  cbam_kernel: 7  # kernel size for CBAM spatial attention (must be 3 or 7)
  sam_reduction: 16  # reduction ratio for SAM
  use_psa: True  # whether to use PSA
  use_cbam: True  # whether to use CBAM
  use_sam: True  # whether to use SAM

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, SCDown, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, SCDown, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]  # 9
  - [-1, 1, PSA, [1024]]  # 10
  - [-1, 1, CBAM, [1024, 7]] 

# YOLOv10 Brain Tumor Detection head with attention
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 13
  - [-1, 1, CBAM, [1024, 7]]  # 14 - Spatial Attention for P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 16 (P3/8-small)
  - [-1, 1, CBAM, [1024, 7]]   # 17 - Channel Attention for P3

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]  # 19 (P4/16-medium)
  - [-1, 1, CBAM, [1024, 7]]  # 20 - Spatial Attention for P4

  - [-1, 1, SCDown, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2fCIB, [1024, True, True]]  # 22 (P5/32-large)
  - [-1, 1, CBAM, [1024, 7]]   # 23 - Channel Attention for P5

  - [[16, 19, 22], 1, v10Detect, [nc]]  # Detect(P3, P4, P5) 