# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv8 object detection model with CBAM attention modules
# Base model: https://docs.ultralytics.com/models/yolov8
# Enhanced with Convolutional Block Attention Module (CBAM)

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8-cbam-n.yaml' will call yolov8-cbam.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8-CBAM-n
  s: [0.33, 0.50, 1024]  # YOLOv8-CBAM-s
  m: [0.67, 0.75, 768]   # YOLOv8-CBAM-m
  l: [1.00, 1.00, 512]   # YOLOv8-CBAM-l
  x: [1.00, 1.25, 512]   # YOLOv8-CBAM-x

# YOLOv8-CBAM backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, CBAM, [32]]  # 3-CBAM (matches C2f output)
  - [-1, 1, Conv, [256, 3, 2]]  # 4-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, CBAM, [64]]  # 6-CBAM (matches C2f output)
  - [-1, 1, Conv, [512, 3, 2]]  # 7-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, CBAM, [128]]  # 9-CBAM (matches C2f output)
  - [-1, 1, Conv, [1024, 3, 2]]  # 10-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, CBAM, [256]]  # 12-CBAM (matches C2f output)
  - [-1, 1, SPPF, [1024, 5]]  # 13

# YOLOv8-CBAM head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 9], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 19 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 16], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]  # 22 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [1024]]  # 25 (P5/32-large)

  - [[19, 22, 25], 1, Detect, [nc]]  # Detect(P3, P4, P5) 